[
  {
    "id": 1,
    "title": "TIJARAH - Admin Console",
    "description": "Developed a Laravel-based Admin Console for the TIJARA Business Management App, used to control and manage core application operations. Implemented role-based access control including Super Admin, Marketing, Data View, Email View, Mobile View, Tutorial, and App Settings modules. Also designed and developed the app landing page using Tailwind CSS.",
    "technologies": [
      "HTML",
      "CSS",
      "Boostrap",
      "javaScript",
      "JQuery",
      "Ajax",
      "DataTables",
      "Firebase",
      "PHP",
      "Laravel",
      "MySQL"
    ],
    "image": "https://i.postimg.cc/MGc39Q7k/image.png",
    "liveLink": "https://tj.somocha.com/",
    "appLink": "https://play.google.com/store/apps/details?id=com.ragory.tijarah.software",
    "challenges": [
      "Due to confidentiality agreements, the source code and admin access credentials cannot be shared publicly."
    ],
    "note": [
      "This project is confidential; therefore, source code and admin login credentials cannot be shared."
    ]
  },
  {
    "id": 6,
    "title": "ELOUISA WEB APPLICATION",
    "description": "Designed and developed a full-featured web application for Movies, TV Shows, Radio, and Live TV, handling everything from UI design to backend development using Laravel. Built a fully dynamic, multi-role Admin Dashboard to manage and control the entire platform, along with RESTful APIs for mobile and app integration. [Note: For preview purposes, admin dashboard access is available using Email: admin@example.com and Password: 12345678. Website preview access is available using Email: connectwithsohag@gmail.com and Password: 12345678.]",
    "technologies": [
      "HTML",
      "CSS",
      "Bootstrap 5",
      "JavaScript",
      "JQuery",
      "PHP",
      "Laravel",
      "REST API",
      "MySQL"
    ],
    "image": "https://i.postimg.cc/JnSD1F0X/elo.png",
    "liveLink": "https://kanalelouisa.com/home",
    "challenges": [
      "Designed and implemented a complex content management system to handle Movies, TV Shows, Radio, and Live TV within a single platform.",
      "Developed a dynamic multi-role Admin Dashboard with permission-based access control for secure and efficient platform management.",
      "Optimized database structure and API responses to ensure fast loading times and smooth performance across web and mobile devices.",
      "Ensured seamless integration between the web platform and mobile applications using RESTful APIs.",
      "Maintained security best practices for authentication, authorization, and sensitive data handling."
    ]
  },
  {
    "id": 2,
    "title": "MULTI VENDOR E-COMMERCE WEBSITE (Imaji-fashion, Korighor, Emela)",
    "description": "Designed and developed a scalable Multi Vendor E-commerce ecosystem using Laravel, serving multiple brands (Imaji-fashion, Korighor, Emela) from a single backend system. Built a secure, RESTful API architecture enabling multiple front-end applications to operate independently on the same backend. Implemented vendor management, product handling, order processing, and role-based access control. Backend source code is confidential and therefore not publicly shared.",
    "technologies": [
      "HTML",
      "CSS",
      "Bootstrap 5",
      "JavaScript",
      "JQuery",
      "Ajax",
      "PHP",
      "Laravel",
      "REST API",
      "MySQL"
    ],
    "image": "https://i.postimg.cc/FzNRsk3S/3.png",
    "githubLink-client": "https://github.com/engineersohag/Imajifashion",
    "challenges": [
      "Designed a single, scalable backend architecture capable of serving multiple independent brands (Imaji-fashion, Korighor, Emela) without data conflict.",
      "Implemented a secure multi-vendor system with role-based access control for Super Admin, Vendor, and Staff to ensure proper permission management.",
      "Developed RESTful APIs that allow multiple front-end applications to operate independently while sharing the same backend services.",
      "Handled complex product, category, and inventory management across different vendors within one ecosystem.",
      "Ensured secure order processing, payment workflow handling, and vendor-wise order segregation.",
      "Optimized database queries and relationships to maintain high performance as the number of vendors, products, and orders scales."
    ]
  }
  
]